cask_args appdir: '/Applications'

# Essential terminal utilities
tap "homebrew/cask"
tap "homebrew/services"

brew "bash"
brew "coreutils"
brew "findutils"

brew "awscli"
brew "bash-completion"
brew "dockutil"
brew "openssl"
brew "git"
brew "git-flow"
brew "httpie"
brew "packer"
brew "tmux"
brew "tmate"
brew "curl", args: ["with-openssl"]
brew "htop"
brew "python"
brew "python3"
brew "n"
brew "tree"
brew "watch"
brew "wget"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Essential Mac applications
tap "caskroom/cask"
tap "caskroom/versions"

#cask "android-sdk"
#cask "android-studio"
cask "docker"
cask "dropbox"
cask "flux"
cask "github"
cask "google-chrome"
cask "java"
cask "iterm2"
cask "microsoft-office"
cask "postman"
cask "skype"
cask "sequel-pro"
cask "spectacle"
cask "spotify"
cask "visual-studio-code"
cask "vlc"

## Jetbrains
cask "jetbrains-toolbox"
cask "datagrip"
cask "goland"
cask "intellij-idea"
cash "phpstorm"
cask "pycharm"
cask "rubymine"
cask "webstorm"

## Mac App Store Apps
mas "BetterSnapTool", id: 417375580
mas "Helium", id: 1054607607
mas "Kindle", id: 405399194
mas "Microsoft Remote Desktop", id: 715768417
mas "Paste JSON as Code • quicktype", id: 1330801220
mas "Postico", id: 1031280567
mas "Sip", id: 507257563
mas "Slack", id: 803453959
mas "SnippetsLab", id: 1006087419
mas "Simplenote", id: 692867256
mas "The Unarchiver", id: 425424353
mas "Todoist", id: 585829637
#mas "Xcode", id: 497799835
