tap "hashicorp/tap"
tap "common-fate/granted"

cask_args appdir: '/Applications'

## Homebrew Utilities
brew "bash"
brew "coreutils"
brew "findutils"

# Unix
brew "universal-ctags"
brew "fzf"
brew "git"
brew "openssl"
brew "rcm"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "watchman"
brew "zsh"

# Dotfiles
brew "rcm"

# AWS
brew "awscli"
brew "common-fate/granted/granted"

# Runtimes
brew "nvm"
brew "goenv"
brew "pyenv"
brew "tfenv"
brew "uv"

# Git
brew "git"
brew "git-flow"
brew "git-extras"
brew "gh"
brew "diff-so-fancy"

# Kubernetes
brew "kubectl"
brew "kubectx"
brew "k9s"
brew "helm"
brew "helmfile"

# Image manipulation
brew "imagemagick"

# PDF Rendering
brew "poppler"

# Programming language prerequisites and package managers
brew "libyaml" # should come after openssl
brew "coreutils"
brew "yarn"
cask "gpg-suite-no-mail"

# Utils
brew "bash-completion"
brew "curl"
brew "dockutil"
brew "go-task"
brew "jq"
brew "htop"
brew "openssl"
brew "hashicorp/tap/packer"
brew "packer-completion"
brew "starship"
brew "speedtest-cli"
brew "tree"
brew "watch"
brew "wget"

# Databases
brew "postgresql@14", restart_service: :changed
brew "redis", restart_service: :changed

# ZSH
brew "zsh-completions"
brew "zsh-syntax-highlighting"

## Fonts
cask "font-fira-code-nerd-font"
cask "font-maple-mono-nf"

## Chat
cask "slack"
cask "zoom"

## Cloud Storage
cask "dropbox"

## Editors
cask "jetbrains-toolbox"
cask "vscodium"
cask "cursor"

## Kubernetes
cask "aptakube"

## Internet Browsers
cask "google-chrome"

## MS Office
cask "microsoft-office"

## Media
cask "spotify"

## Programming Util
cask "codekit"
cask "docker"
cask "github"
cask "iterm2"
cask "obsidian"
cask "postman"

## Utility
cask "alt-tab"
cask "raycast"
cask "notunes"
cask "twingate"
